Revit 2024 API
Camera.TargetDistance Property
 Distance from camera to its target
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public double TargetDistance { get; set; }
Visual Basic
Public Property TargetDistance As Double
	Get
	Set
Visual C++
public:
property double TargetDistance {
	double get ();
	void set (double value);
}
See Also
Camera Class
Autodesk.Revit.DB.DirectContext3D Namespace